{
  "date": "2026-01-20",
  "crawled_at": "2026-01-20T03:26:09.054681",
  "total_papers": 2,
  "papers": [
    {
      "title": "Multiplex Thinking: Reasoning via Token-wise Branch-and-Merge",
      "url": "https://huggingface.co/papers/2601.08808",
      "published": "2026-01-20T03:26:06.245730",
      "likes": 6,
      "institution": "Microsoft Research1",
      "paper_link": "https://arxiv.org/abs/2601.08808",
      "code_link": "https://gmlr-penn.github.io/Multiplex-Thinking/",
      "abstract": "Large language models often solve complex reasoning tasks more effectively with Chain-of-Thought (CoT), but at the cost of long, low-bandwidth token sequences. Humans, by contrast, often reason softly by maintaining a distribution over plausible next steps. Motivated by this, we propose Multiplex Thinking, a stochastic soft reasoning mechanism that, at each thinking step, samples K candidate tokens and aggregates their embeddings into a single continuous multiplex token. This preserves the vocabulary embedding prior and the sampling dynamics of standard discrete generation, while inducing a tractable probability distribution over multiplex rollouts. Consequently, multiplex trajectories can be directly optimized with on-policy reinforcement learning (RL). Importantly, Multiplex Thinking is self-adaptive: when the model is confident, the multiplex token is nearly discrete and behaves like standard CoT; when it is uncertain, it compactly represents multiple plausible next steps without increasing sequence length. Across challenging math reasoning benchmarks, Multiplex Thinking consistently outperforms strong discrete CoT and RL baselines from Pass@1 through Pass@1024, while producing shorter sequences. The code and checkpoints are available at this https URL ."
    },
    {
      "title": "CoDance: An Unbind-Rebind Paradigm for Robust Multi-Subject Animation",
      "url": "https://huggingface.co/papers/2601.11096",
      "published": "2026-01-20T03:26:06.245730",
      "likes": 1,
      "institution": "·8 authors1",
      "paper_link": "https://arxiv.org/abs/2601.11096",
      "code_link": "https://lucaria-academy.github.io/CoDance/",
      "abstract": "Character image animation is gaining significant importance across various domains, driven by the demand for robust and flexible multi-subject rendering. While existing methods excel in single-person animation, they struggle to handle arbitrary subject counts, diverse character types, and spatial misalignment between the reference image and the driving poses. We attribute these limitations to an overly rigid spatial binding that forces strict pixel-wise alignment between the pose and reference, and an inability to consistently rebind motion to intended subjects. To address these challenges, we propose CoDance, a novel Unbind-Rebind framework that enables the animation of arbitrary subject counts, types, and spatial configurations conditioned on a single, potentially misaligned pose sequence. Specifically, the Unbind module employs a novel pose shift encoder to break the rigid spatial binding between the pose and the reference by introducing stochastic perturbations to both poses and their latent features, thereby compelling the model to learn a location-agnostic motion representation. To ensure precise control and subject association, we then devise a Rebind module, leveraging semantic guidance from text prompts and spatial guidance from subject masks to direct the learned motion to intended characters. Furthermore, to facilitate comprehensive evaluation, we introduce a new multi-subject CoDanceBench. Extensive experiments on CoDanceBench and existing datasets show that CoDance achieves SOTA performance, exhibiting remarkable generalization across diverse subjects and spatial layouts. The code and weights will be open-sourced."
    }
  ]
}